portfolio_app/app/controllers/students_controller.rb

INSERT INTO "students" ("name", "school_email", "major", "graduation_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", ""], ["school_email", ""], ["major", ""], ["graduation_date", nil], ["created_at", "2024-09-12 19:16:21.204004"], ["updated_at", "2024-09-12 19:16:21.204004"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "updated_at" = ? WHERE "students"."id" = ?  [["updated_at", "2024-10-10 19:41:54.551531"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def destroy
    @student.destroy!